Tekla.Structures.Model.Solid
The Solid class represents the physical object in the model created by a part instance.
A solid instance can be used to query the actual geometry of the part and intersect that
geometry with, for example, lines and planes.
using Tekla.Structures.Model;
using Tekla.Structures.Solid;
using Tekla.Structures.Geometry3d;
using System.Collections;
public class Example
{
public void Example1()
{
Beam MyPart = new Beam();
ArrayList MyList = new ArrayList();
ArrayList MyFaceNormalList = new ArrayList();
Solid Solid = MyPart.GetSolid();
FaceEnumerator MyFaceEnum = Solid.GetFaceEnumerator();
while (MyFaceEnum.MoveNext())
{
Face MyFace = MyFaceEnum.Current as Face;
if (MyFace != null)
{
MyFaceNormalList.Add(MyFace.Normal);
LoopEnumerator MyLoopEnum = MyFace.GetLoopEnumerator();
while (MyLoopEnum.MoveNext())
{
Loop MyLoop = MyLoopEnum.Current as Loop;
if (MyLoop != null)
{
VertexEnumerator MyVertexEnum = MyLoop.GetVertexEnumerator() as VertexEnumerator;
while (MyVertexEnum.MoveNext())
{
Point MyVertex = MyVertexEnum.Current as Point;
if (MyVertex != null)
{
MyList.Add(MyVertex);
}
}
}
}
}
}
}
}